Repository: hperala/salakanto
Catalog: website/locale/*/LC_MESSAGES/messages.po
Languages: fi_fi

source: The root creation password is incorrect.
fi_fi: Root-tunnuksen luontisalasana ei kelpaa.

source: Using Salakanto
fi_fi: Salakannon käyttö

source: Help
fi_fi: Ohje

source: Main View
fi_fi: Tervetuloa Salakantoon

source: Editing source
fi_fi: Lähteen muokkaus

source: Editing %s
fi_fi: Muokataan kohdetta %s

source: New source
fi_fi: Uusi lähde

source: Sources
fi_fi: Lähteet

source: Site administration
fi_fi: Sivuston ylläpito

source: All names
fi_fi: Kaikki nimet

source: All Names
fi_fi: Kaikki nimet

source: User account
fi_fi: Käyttäjätunnus

source: Account details
fi_fi: Käyttäjätunnuksen tiedot

source: Forms with explicit translation
fi_fi: Käännöksellä varustetut muodot

source: %s title
fi_fi: %s – Salakanto

source: Login
fi_fi: Kirjaudu sisään

source: Log in
fi_fi: Kirjaudu sisään

source: Sign up
fi_fi: Luo käyttäjätunnus

source: Imported %d names (%d instances) and %d sources.
fi_fi: Tuotiin %d nimeä (%d instanssia) ja %d lähdettä.

source: Importing failed: %s
fi_fi: Tuonti epäonnistui: %s

source: The username or password is incorrect.
fi_fi: Käyttäjänimi tai salasana on virheellinen.

source: Root user does not exist and must be created next.
fi_fi: Root-tunnusta ei ole olemassa. Se on luotava seuraavaksi.

source: Username:
fi_fi: Käyttäjätunnus:

source: Password:
fi_fi: Salasana:

source: Create root account
fi_fi: Luo root-tunnus

source: Enter root creation password:
fi_fi: Anna root-tunnuksen luontisalasana:

source: Names
fi_fi: Nimet

source: Translations
fi_fi: Käännöksiä

source: Log out
fi_fi: Kirjaudu ulos

source: Create account
fi_fi: Luo tunnus

source: Edit
fi_fi: Muokkaa

source: Delete
fi_fi: Poista

source: Change password
fi_fi: Vaihda salasana

source: Old password:
fi_fi: Vanha salasana:

source: New password:
fi_fi: Uusi salasana:

source: Enter new password again:
fi_fi: Uusi salasana uudestaan:

source: Other tasks
fi_fi: Muut tehtävät

source: Administration
fi_fi: Ylläpito

source: Import data
fi_fi: Tuo tietoja

source: Filename:
fi_fi: Tiedostonimi:

source: Users
fi_fi: Käyttäjät

source: Username
fi_fi: Käyttäjätunnus

source: Created
fi_fi: Luotu

source: Enabled
fi_fi: Aktivoitu

source: Abbreviation:
fi_fi: Lyhenne:

source: Max. 50 characters.
fi_fi: Enintään 50 merkkiä.

source: Year:
fi_fi: Vuosi:

source: Approximate year of writing. Numbers only. Used for sorting purposes.
fi_fi: Arvioitu kirjoitusvuosi. Käytä ainoastaan numeroita. Arvoa käytetään lajitteluun.

source: Text:
fi_fi: Teksti:

source: Enough information to identify the document, e.g. full name, where published.
fi_fi: Dokumentin yksilöivät tiedot, esimerkiksi koko nimi ja teos, jossa se on julkaistu.

source: Next
fi_fi: Seuraava

source: Previous
fi_fi: Edellinen

source: Add
fi_fi: Lisää

source: Name
fi_fi: Nimi

source: Etymological notes
fi_fi: Etymologisia huomautuksia

source: Title:
fi_fi: Otsikko:

source: A typical, well known form of the name.
fi_fi: Jokin nimen tunnettu ja yleinen muoto.

source: Description:
fi_fi: Kuvaus:

source: Full description of the scope of this entry, if needed.
fi_fi: Tarkempi kuvaus siitä, mitä tähän hakusana-artikkeliin sisältyy (jos tarpeen).

source: Indexes covered:
fi_fi: Katetut hakemistot:

source: Sources that have been covered by checking every occurrence of the name given in the index of that source. A list of abbreviations.
fi_fi: Lähteet, jotka on käsitelty tarkistamalla jokainen nimen esiintymä kyseisen lähteen hakemistossa. Luettelo lyhenteitä.

source: Other covered sources:
fi_fi: Muut katetut lähteet:

source: Information about other sources that have been processed using some method.
fi_fi: Tiedot muista lähteistä, jotka on käyty läpi jollakin menetelmällä.

source: Secondary sources:
fi_fi: Sekundäärilähteet:

source: Annotated bibliography of material relevant to this name. Markup allowed, enclose text in [p][/p].
fi_fi: Kommentoitu luettelo tähän nimeen liittyvästä kirjallisuudesta. Merkkaus sallittu, ympäröi teksti [p][/p]-tageilla.

source: Notes:
fi_fi: Huomautuksia:

source: Other information about this name. For example: first appearance, normalization of spelling in some source. Markup allowed, enclose text in [p][/p].
fi_fi: Muuta nimeen liittyvää tietoa. Esimerkkejä: ensiesiintymä, kirjoitusasun normalisointi jossakin lähteessä. Merkkaus sallittu, ympäröi teksti [p][/p]-tageilla.

source: Instances:
fi_fi: Esiintymät:

source: Instance
fi_fi: Esiintymä

source: help-1
fi_fi: TBA

source: The form:
fi_fi: Muoto:

source: Source:
fi_fi: Lähde:

source: Source details:
fi_fi: Lähteen tarkennus:

source: Reference:
fi_fi: Viite:

source: Note:
fi_fi: Huomautus:

source: Translation:
fi_fi: Käännös:

source: Etymology:
fi_fi: Etymologia:

source: The following sources have been covered by checking every reference in the index:
fi_fi: Lähteet, joista on tarkistettu jokainen hakemistossa mainittu nimen esiintymä:

source: The following sources have been covered by other means:
fi_fi: Lähteet, jotka on käyty läpi jollain muulla menetelmällä:

source: Forms
fi_fi: Muodot

source: Short list
fi_fi: Lyhyt luettelo

source: Full details
fi_fi: Kaikki tiedot

source: Translations and etymological notes
fi_fi: Käännökset ja etymologiset selitykset

source: Notes
fi_fi: Huomautuksia

source: Secondary sources
fi_fi: Sekundäärilähteet

source: Hello, world!
fi_fi: Tämä on Salakanto-sovelluksen kehitysversio, josta puuttuu toistaiseksi monia ominaisuuksia. Salakanto on yksinkertainen nimivarianttien ja käännösten tietokanta. Se on nimetty Gondolinin haltia Salgantin (qenyaksi Salakanto) mukaan.

source: Single form only, no extra notes.
fi_fi: Vain yksi muoto, ei lisähuomautuksia.

source: The document where this form appears.
fi_fi: Dokumentti, jossa muoto esiintyy.

source: Details of the source, if the selected label is very generic.
fi_fi: Tarkemmat tiedot lähteestä, jos valittu nimike on hyvin yleisluontoinen.

source: Page reference.
fi_fi: Sivuviite.

source: A note concerning this particular instance.
fi_fi: Tätä esiintymää koskeva huomautus.

source: Leave empty if no explicit translation is given for this instance.
fi_fi: Jätä tyhjäksi, jos tätä esiintymää ei ole suoraan käännetty.

source: e.g. &lt; [w]form[/w] ‘transl.’ ([r]ROOT-[/r])
fi_fi: esim. &lt; [w]muoto[/w] ‘käännös’ ([r]JUURI-[/r])

source: A summary of etymological notes associated with this instance. Markup allowed.
fi_fi: Yhteenveto tähän esiintymään liittyvistä etymologisista muistiinpanoista. Merkkaus sallittu.
